            01  PAR-IN.
              03  OPCODE-IN      PIC X(2).
              03  DATA-IN.
                 05  DATA-IN-1 PIC X(64).
                 05  DATA-IN-2 PIC X(64).
                 
            01  PAR-OUT.
              03  OPCODE-OUT      PIC X(2).
              03  DATA-OUT.
                 05  DATA-OUT-1 PIC X(64).
                 05  DATA-OUT-2 PIC X(64).
                 
