            01 G PIC X(99).
            01 H PIC X(99).
            01 I PIC X(99).
            01 J PIC X(99).
            01 K PIC X(99).
            01 L PIC X(99).
            01 LRED REDEFINES L PIC 9(29).
