            01 A PIC X(99) VALUE 'ABCD1234'.
            01 B PIC X(99).
            01 C PIC X(99).
            01 D PIC X(99).
            01 E PIC X(99).
            01 F PIC X(99).

            01 GRP.
                03 G1 PIC X(99).
                03 G2 PIC X(99).
                03 G3 PIC X(99).
                03 GRP2.
                    05 GG1 PIC X(99) VALUE 'XYZ123'.
                    05 GG2 PIC X(99).

        COPY COPY2.